upstream/OpenFOAM-v2606/tutorials/incompressible/pimpleFoam/RAS/propeller1/Allrun.post
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

if notTest "$@"
then

    runParallel -o -s postpro $(getApplication) -postProcess -latestTime

fi

#------------------------------------------------------------------------------
