upstream/OpenFOAM-v2606/tutorials/incompressible/pimpleFoam/RAS/propeller1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    innerCylinderSmall;
        type    cellZoneSet;
        action  new;

        source  cylinderToCell;
        point1  (-0.25 0 0);
        point2  (0.25 0 0);
        radius  0.6;
    }
);


// ************************************************************************* //
